<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"de1621c9937b74ccfbdad7733c2687f52d8f8b5d5d450b7069916c345219ed98","plan_job_ref":"Job Terraform Plan #84 at https://github.com/ironashram/kub1k/actions/runs/10451824994","plan_out_hash":"8b15bb1030f0a22acd5f5ab7e16f222b8aed6e7ab1bcc351b09bd4fb46930a4c","plan_hash":"7e7c8ea1656d4ea15aaf5f3145dfec3c146928f1d87a3d634daec1608579017e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-08-14T22:38:14Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #84](https://github.com/ironashram/kub1k/actions/runs/10451824994)